Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Define custom attributes for your view in a <declare-styleable> resource element
zh_cn: 在 <declare-styleable> 资源元素中为 view 定义自定义属性

source: Define gradient fills by creating LinearGradient objects.
zh_cn: 通过创建 LinearGradient 对象来定义渐变填充。

source: Define the order of appearance for two views, either vertically or horizontally.
zh_cn: 定义两个 view 的垂直或水平出现的顺序。

source: Delayed Loading of Views
zh_cn: 延迟加载视图

source: Description
zh_cn: 描述

source: Design For Accessibility
zh_cn: 设计无障碍功能

source: Design considerations
zh_cn: 设计注意事项

source: Developers have full access to the same framework APIs that Android system apps use.
zh_cn: 开发者可以完全访问 Android 系统应用程序使用的框架 API。

source: Do Less, Less Frequently
zh_cn: 尽可能少地频繁调用

source: Do not broadcast sensitive information using an implicit intent.
zh_cn: 不要使用隐式 intent 广播敏感信息。

source: Do not specify this attribute if the value is a color.
zh_cn: 如果值是颜色，则不要指定此属性。

source: Do not start activities from broadcast receivers because the user experience is jarring; especially if there is more than one receiver.
zh_cn: 不要从广播接收器启动 activity，因为用户体验不稳定；特别是如果有多个接收器。

source: Do not unregister in onSaveInstanceState(Bundle), because this isn't called if the user moves back in the history stack.
zh_cn: 不要在 onSaveInstanceState(Bundle) 中注销，因为如果用户移回历史堆栈中，则不会调用此命令。

source: Do one of the following:
zh_cn: 执行下列操作之一：

source: Documentation for each broadcast action is available in its associated constant field.
zh_cn: 每个广播 action 的文档在其关联的常量字段中可用。

source: Drag a view from the Palette window into the editor.
zh_cn: 将 view 从 Palette 窗口拖到编辑器中。

source: Drag the dotted line to reposition it and click the circle at the edge of the guideline to toggle the measurement mode.
zh_cn: 拖动虚线来重新定位它，并单击参考线边缘处的圆圈来切换测量模式。

source: Draw bitmaps using drawBitmap().
zh_cn: 使用 drawBitmap() 绘制位图。

source: Draw more complex shapes using the Path class.
zh_cn: 使用 Path 类绘制更复杂的形状。

source: Draw primitive shapes using drawRect(), drawOval(), and drawArc().
zh_cn: 使用 drawRect()，drawOval() 和 drawArc() 绘制基本形状。

source: Draw text using drawText().
zh_cn: 使用 drawText() 绘制文本。

source: Drawing
zh_cn: 绘制

source: Drawing a UI is only one part of creating a custom view.
zh_cn: 绘制 UI 只是创建自定义 view 的一部分。

source: Duration: You can specify the duration of an animation.
zh_cn: 持续时间：可以指定动画的持续时间。

source: During the whole animation, the ValueAnimator calculates an elapsed fraction between 0 and 1, based on the duration of the animation and how much time has elapsed.
zh_cn: 在整个动画过程中，ValueAnimator 计算计算 0 到 1 之间的 elapsed fraction (经过分数)，根据动画的持续时间和经过的时间。

source: Each <set> can define its own ordering attribute.
zh_cn: 每个 <set> 可以定义其自己的 ordering 属性。

source: Each ViewStub simply needs to include the android:layout attribute to specify the layout to inflate.
zh_cn: 每个 ViewStub 都需要包含 android:layout 属性来指定要加载的布局。

source: Each broadcast action has a constant field associated with it.
zh_cn: 每个广播 action 都有一个与之关联的常量字段。

source: Each constraint defines the view's position along either the vertical or horizontal axis; so each view must have a minimum of one constraint for each axis, but often more are necessary.
zh_cn: 每一个约束都定义了 View 在水平或垂直方向的位置：因此每一个 View 与轴线（垂直和水平方向）都至少应该有一个约束。

source: Each constraint handle can be used for just one constraint, but you can create multiple constraints (from different views) to the same anchor point.
zh_cn: 每个约束句柄只能用于一个约束，但你可以创建多个约束(从不同的 view)到同一个定位点。

source: Each constraint represents a connection or alignment to another view, the parent layout, or an invisible guideline.
zh_cn: 每一个约束表示到另一个 view，父布局，或者不可见的参考线的连接或者对齐。

source: Each one has an attribute value that can be applied in the XML.
zh_cn: 每一个都有一个属性值，可以在 XML 中应用。

source: Each transformation takes a set of parameters specific for that transformation (starting size and ending size for size change, starting angle and ending angle for rotation, and so on), and also a set of common parameters (for instance, start time and duration).
zh_cn: 每个变换都有一组特定于该变换的参数(大小更改的起始大小和结束大小、旋转的起始角度和结束角度等)，以及一组常用参数(例如，开始时间和持续时间)。

source: Effects on process state
zh_cn: 对进程状态的影响

source: Either way, you want something that the built-in components just won't do, no matter how you combine them.
zh_cn: 不管怎样，你的需求预制的组件是无法完成的，不管你怎么组合它们。

source: Enable it by clicking Enable Autoconnection to Parent in the Layout Editor toolbar.
zh_cn: 通过单击布局编辑器工具栏中的 Enable Autoconnection to Parent 来启用它。

source: Ending X offset.
zh_cn: 结束 X 轴偏移。

source: Ending X size offset, where 1.0 is no change.
zh_cn: 结束 X 尺寸偏移，其中 1.0 不变。

source: Ending Y offset.
zh_cn: 结束 Y 偏移。

source: Ending Y size offset, where 1.0 is no change.
zh_cn: 结束 Y 尺寸偏移，其中 1.0 不变。

source: Ending angular position, in degrees.
zh_cn: 结束角度位置，以度为单位。

source: Ending opacity offset, where 0.0 is transparent and 1.0 is opaque.
zh_cn: 结束不透明度偏移，其中 0.0 是透明的，1.0 是不透明的。

source: Ensure you have the maven.google.com repository declared in your module-level build.gradle file:
zh_cn: 确保你在模块级 build.gradle 文件中声明 maven.google.com 仓库：

source: Enter a name for the layout file and enter "android.support.constraint.ConstraintLayout" for the Root Tag.
zh_cn: 输入一个布局文件的名字，然后输入 "android.support.constraint.ConstraintLayout" 作为 Root Tag。

source: Evaluators tell the property animation system how to calculate values for a given property.
zh_cn: 求值器告诉属性动画系统如何计算给定属性的值。

source: Even if only one app uses your view, that app needs to handle different screen sizes, multiple screen densities, and various aspect ratios in both portrait and landscape mode.
zh_cn: 即使只有一个应用程序使用你的 view，该应用程序也需要在纵向和横向模式下处理不同的屏幕尺寸，多个屏幕密度和各种宽高比。

source: Even so, the animation will still be drawn beyond the bounds of its View and will not be clipped.
zh_cn: 即使如此，动画仍将绘制在其视图的边界之外，并且不会被剪裁。

source: Event processing
zh_cn: 事件处理

source: Every 10 ms, which is the default frame refresh rate, the object moves horizontally by 10 pixels.
zh_cn: 每 10 毫秒(默认的帧刷新率)对象水平移动 10 像素。

source: Every view implements onDraw() differently, but there are some common operations that most views share:
zh_cn: 每个 view 以不同方式实现 onDraw()，但大多数 view 共享一些常见操作：

source: Every view must have at least two constraints: one horizontal and one vertical.
zh_cn: 每一个 view 必须至少有两个约束：一个水平和一个垂直约束。

source: Example of a linear animation
zh_cn: 线性动画示例

source: Example of a non-linear animation
zh_cn: 非线性动画示例

source: Example: Change background color
zh_cn: 示例：更改背景色

source: Examples of each chain style
zh_cn: 每种链样式的示例

source: Except a barrier does not define its own position; instead, the barrier position moves based on the position of views contained within it.
zh_cn: 但是，屏障并不定义其自身的位置；相反，屏障位置是基于其内包含的视图的位置移动的。

source: Expands the view as much as possible to meet the constraints on each side.
zh_cn: 尽可能扩展视图以满足每一侧的约束。

source: Expands the view only as much as needed to fit its contents, but still allows the view to be smaller than that if the constraints require it.
zh_cn: 仅根据需要扩展视图以适合其内容，但如果约束要求，仍允许视图小于该视图。

source: Expressed either: in pixels relative to the normal position (such as "5"), in percentage relative to the element height (such as "5%"), or in percentage relative to the parent height (such as "5%p").
zh_cn: 表示为：相对于正常位置的像素(例如 "5")、相对于元素高度的百分比(例如 "5%")或相对于父高度的百分比(例如 "5%p")。

source: Expressed either: in pixels relative to the normal position (such as "5"), in percentage relative to the element width (such as "5%"), or in percentage relative to the parent width (such as "5%p").
zh_cn: 表示为：相对于正常位置的像素(例如 "5")、相对于元素宽度的百分比(例如 "5%")或相对于父宽度的百分比(例如 "5%p")。

source: Expressed either: in pixels relative to the object's left edge (such as "5"), in percentage relative to the object's left edge (such as "5%"), or in percentage relative to the parent container's left edge (such as "5%p").
zh_cn: 表示为：相对于对象左边缘的像素(例如 "5")、相对于对象左边缘的百分比(例如 "5%")或相对于父容器左边缘的百分比(例如 "5%p")。

source: Expressed either: in pixels relative to the object's top edge (such as "5"), in percentage relative to the object's top edge (such as "5%"), or in percentage relative to the parent container's top edge (such as "5%p").
zh_cn: 表示为：相对于对象上边缘的像素(例如 "5")、相对于对象上边缘的百分比(例如 "5%")或相对于父容器上边缘的百分比(例如 "5%p")。

source: Extend onDraw() and onMeasure()
zh_cn: 重写 onDraw() 和 onMeasure() 方法。

source: Extend an existing View class or subclass with your own class.
zh_cn: 继承一个已存在的 View 类或你自己的类。

source: Failure to do this will result in an exception being thrown.
zh_cn: 如果不这样做将导致抛出一个异常。

source: Figure 1 depicts a hypothetical object that is animated with its x property, which represents its horizontal location on a screen.
zh_cn: 图 1 描述了一个假设对象，该对象的 x 属性表示其在屏幕上的水平位置。

source: Figure 2 illustrates a hypothetical object that accelerates at the beginning of the animation, and decelerates at the end of the animation.
zh_cn: 图 2 演示了一个假设对象，它在动画开始时加速，在动画结束时减速。

source: Figure 3 depicts how the main classes work with one another.
zh_cn: 图 3 描述了主类如何相互协作。

source: First, let's go over how an animation works with a simple example.
zh_cn: 首先，我们用一个简单的例子来说明动画是如何工作的。

source: Fling Animation
zh_cn: 投掷动画

source: Focus
zh_cn: 焦点

source: Follow these steps to start using MotionLayout in your project.
zh_cn: 请按照以下步骤开始在项目中使用 MotionLayout。

source: For a complete list of system broadcast actions, see the BROADCAST_ACTIONS.TXT file in the Android SDK.
zh_cn: 有关系统广播操作的完整列表，请参阅 Android SDK 中的 broadcast_actions.TXT 文件。

source: For a more detailed look at the various elements that MotionScene supports, see the MotionLayout examples.
zh_cn: 对于在该 MotionScene 支持各种元件更详细的研究，见 MotionLayout examples。

source: For additional information on this topic, see Optimize with stubs (blog post).
zh_cn: 有关此主题的其他信息，请参见 Optimize with stubs (blog post)。

source: For all the details, see Start an Activity with an Animation.
zh_cn: 有关所有详细信息，请参见 Start an Activity with an Animation。

source: For an example, if you register within an Activity context, you receive broadcasts as long as the activity is not destroyed.
zh_cn: 例如，如果你使用 Activity 上下文注册，只要该 Activity 未被 destroyed，你就可以接收广播。

source: For detailed reference information, see the View class.
zh_cn: 对于详细的参考信息，见 View 类。

source: For devices running Android version 5.0 (API level 21) or higher, each app runs in its own process and with its own instance of the Android Runtime (ART).
zh_cn: 对于运行 Android 5.0 版(API 级别 21)或更高版本的设备，每个应用程序都在其自己的进程中运行，并带有自己的 Android Runtime (ART) 实例。

source: For each <declare-styleable> resource in the res directory, the generated R.java defines both an array of attribute ids and a set of constants that define the index for each attribute in the array.
zh_cn: 对于 res 目录中的每个 <declare-styleable> 资源，生成的 R.java 定义属性 id 数组和一组常量，这些常量定义数组中每个属性的索引。

source: For each interpolator class, Android includes a public resource you can reference in order to apply the interpolator to an animation using the android:interpolator attribute.
zh_cn: 对于每个插值器类，Android 包含一个公共资源，你可以引用它，以便使用 android:interpolator 属性将插值器应用于动画。

source: For example you can specify "alpha" or "backgroundColor" for a View object.
zh_cn: 例如，可以为视图对象指定 "alpha" 或 "backgroundColor"。

source: For example, the Android Runtime (ART) relies on the Linux kernel for underlying functionalities such as threading and low-level memory management.
zh_cn: 例如，Android Runtime (ART) 依赖于 Linux 内核为基础的功能，诸如线程和低级别的存储器管理。

source: For example, backgroundColor is supported, since our view has underlying getBackgroundColor() and setBackgroundColor() methods.
zh_cn: 例如，支持 backgroundColor，因为我们的视图有底层的 getBackgroundColor() 和 setBackgroundColor() 方法。

source: For example, motion:dragDirection="dragRight" means that progress increases as you drag to the right.
zh_cn: 例如，motion:dragDirection="dragRight" 表示向右拖动时进度会增加。

source: For example, a Combo Box can be thought of as a combination of a single line EditText field and an adjacent button with an attached PopupList.
zh_cn: 比如，Combo Box 可被认为是一个单行的 EditText 和一个与 PopupList 相邻的按钮组成而成。

source: For example, a value of "1" means that the animation is repeated once after the initial run of the animation, so the animation plays a total of two times.
zh_cn: 例如，值 "1" 表示动画在初始运行后重复一次，因此动画总共播放两次。

source: For example, a yes/no button panel, or custom progress bar with description text.
zh_cn: 例如，是/否按钮面板或带有说明文本的自定义进度条。

source: For example, animating a play button transforming into a pause button when tapped is a nice way to communicate to the user that the two actions are related, and that pressing one makes the other visible.
zh_cn: 例如，点击时将播放按钮动画转换成暂停按钮，是一个很好的方式来告知用户，这两个行动是相关的，按下一个，使另一个可见。

source: For example, assume your receiving app has a manifest-declared receiver as shown below:
zh_cn: 例如，假设你的接收应用程序有一个清单声明的接收器，如下所示：

source: For example, figure 1 shows a layout that's used as an item in a ListView.
zh_cn: 例如，图 1 显示了一个在 ListView 中用作项的布局。

source: For example, figure 10 shows B with a 24dp offset alignment.
zh_cn: 例如，图 7 展示了 B 的对齐具有 24dp 偏移量。

source: For example, figure 13 shows view C is constrained to the right side of a barrier.
zh_cn: 例如，图 13 显示视图 C 被限制在屏障的右侧。

source: For example, figure 2 shows the layout for the list item illustrated by figure 1.
zh_cn: 例如，图 2 显示了图 1 所示的列表项的布局。

source: For example, here's a layout that defines a title bar to be included in each activity (titlebar.xml):
zh_cn: 例如，这里有一个布局，它定义了要包含在每个 activity 中的标题栏(titlebar.xml)：

source: For example, here's a layout that includes the title bar from above:
zh_cn: 例如，下面是一个布局，其中包括上面的标题栏：

source: For example, here's how to use the attributes defined for PieChart:
zh_cn: 例如，以下是如何使用为 PieChart 定义的属性：

source: For example, here's the code that draws PieChart.
zh_cn: 例如，这是绘制 PieChart 的代码。

source: For example, if process A has bound to a Service with the Context.BIND_AUTO_CREATE flag or is using a ContentProvider in process B, then process B's classification will always be at least as important as process A's.
zh_cn: 例如，如果过程 A 已绑定到进程 B 中 Service 用 Context.BIND_AUTO_CREATE 标志，或使用进程 B 中的 ContentProvider，则进程 B 的分类将总是至少与进程 A 的一样重要。

source: For example, if these values are 0, 0 (top-left corner), all growth will be down and to the right.
zh_cn: 例如，如果这些值是 0,0(左上角)，所有的增长将是向下和向右。

source: For example, if you set both sides to "match constraints", click Toggle Aspect Ratio Constraint twice to set the width be a ratio of the height.
zh_cn: 例如，如果你将两边设置为 "match constraints"，点击 click Toggle Aspect Ratio Constraint 两次来将宽度设置为高度的比率。

source: For example, if your app would like to deliver an SMS message, you don't need to build that functionality yourself—you can instead invoke whichever SMS app is already installed to deliver a message to the recipient you specify.
zh_cn: 例如，如果你的应用程序希望发送短信，则不需要自己构建该功能，你可以调用已安装的任何短消息应用程序来将消息发送给指定的收件人。

source: For example, if your main layout is a vertical LinearLayout in which two consecutive views can be re-used in multiple layouts, then the re-usable layout in which you place the two views requires its own root view.
zh_cn: 例如，如果主布局是一个垂直的 LinearLayout，其中两个连续的视图可以在多个布局中重用，则放置两个视图的可重用布局需要自己的根视图。

source: For example, images should not immediately pop out of existence and reappear somewhere else, because objects in the real world don't do that.
zh_cn: 例如，图像不应该立即弹出并重新出现在其他地方，因为现实世界中的对象不会这样做。

source: For example, in Figure 1, the elapsed fraction at t = 10 ms would be .25 because the total duration is t = 40 ms.
zh_cn: 例如，在图 1 中，由于总持续时间为 t=40 ms，t=10 ms 时的经过的分数将为 .25。

source: For example, in Figure 2, because the animation slowly accelerates, the interpolated fraction, about .15, is less than the elapsed fraction, .25, at t = 10 ms.
zh_cn: 例如，在图 2 中，由于动画缓慢加速，在 t=10ms 时，插值分数大约为 .15，小于经过分数 .25。

source: For example, in Figure 2, the TimeInterpolator used would be AccelerateDecelerateInterpolator and the TypeEvaluator would be IntEvaluator.
zh_cn: 例如，在图 2 中，所使用的 TimeInterpolator 将是 AccelerateDecelerateInterpolator，而 TypeEvaluator 将是 IntEvaluator。

source: For example, in Figure 2, the interpolated fraction was .15 at t = 10 ms, so the value for the property at that time would be .15 × (40 - 0), or 6.
zh_cn: 例如，在图 2 中，t=10 ms 时，插值分数为 .15，因此此时属性的值为 .15×(40-0)或 6。

source: For example, the CONNECTIVITY_ACTION broadcast is delivered only to context-registered receivers.
zh_cn: 例如，CONNECTIVITY_ACTION 广播仅传送给上下文注册的接收器。

source: For example, the Android system sends broadcasts when various system events occur, such as when the system boots up or the device starts charging.
zh_cn: 例如，当各种系统事件发生时，比如当系统启动或设备开始充电时，Android 系统发送广播。

source: For example, the airplane mode intent includes a boolean extra that indicates whether or not Airplane Mode is on.
zh_cn: 例如，飞行模式 intent 包含一个布尔 extra，指示飞行模式是否打开。

source: For example, the following code sends a broadcast:
zh_cn: 例如，以下代码发送广播：

source: For example, the value of the constant ACTION_AIRPLANE_MODE_CHANGED is android.intent.action.AIRPLANE_MODE.
zh_cn: 例如，常量 ACTION_AIRPLANE_MODE_CHANGED 的值为 android.intent.action.AIRPLANE_MODE。

source: For example, they should maintain momentum when their target changes, and make smooth transitions during any changes.
zh_cn: 例如，当目标发生变化时，它们应该保持动力，并在任何变化期间平滑过渡。

source: For example, using nested instances of LinearLayout can lead to an excessively deep view hierarchy.
zh_cn: 例如，使用 LinearLayout 的嵌套实例可能会导致视图层次结构过深。

source: For example, when a process executes a receiver (that is, currently running the code in its onReceive() method), it is considered to be a foreground process.
zh_cn: 例如，当一个进程执行一个接收器(即，当前正在其 onReceive() 方法中运行代码)时，它被认为是一个前台进程。

source: For example, when the user taps an item to see more information, you can replace the layout with the item details, applying a transition like the one shown in figure 5.
zh_cn: 例如，当用户点击一个项目以查看更多信息时，你可以用项目详细信息替换布局，应用如图 5 所示的过渡。

source: For example, when the user taps an item to see more information, you can transition into a new activity with an animation that seamlessly grows that item to fill the screen, like the animation shown in figure 5.
zh_cn: 例如，当用户点击一个项目以查看更多信息时，你可以切换到一个新的 activity，其中的动画可以无缝地扩展该项目以填充屏幕，如图 5 所示。

source: For example, when users fling a UI object, they should sense friction at the beginning that delays the motion, and then at the end sense momentum that carries the motion beyond the fling.
zh_cn: 例如，当用户投掷 UI 对象时，他们应该在开始时感知延迟运动的摩擦，然后在结束时感知带动运动超出投掷的动量。

source: For example, when you change the position properties, the view moves across the screen, or when you change the alpha property, the view fades in or out.
zh_cn: 例如，当你更改位置属性时，视图将在屏幕上移动，或者当你更改 alpha 属性时，视图将淡入或淡出。

source: For example, you can access OpenGL ES through the Android framework’s Java OpenGL API to add support for drawing and manipulating 2D and 3D graphics in your app.
zh_cn: 例如，你可以通过 Android 框架的 Java OpenGL API 访问 OpenGL ES 来添加对在应用程序中绘制和操作 2D 和 3D 图形的支持。

source: For example, you can adjust the rate of acceleration for the AnticipateInterpolator, or adjust the number of cycles for the CycleInterpolator.
zh_cn: 例如，你可以调整 AnticipateInterpolator 的加速度，或调整 CycleInterpolator 的循环数。

source: For example, you can specify animations to happen linearly across the whole animation, meaning the animation moves evenly the entire time, or you can specify animations to use non-linear time, for example, accelerating at the beginning and decelerating at the end of the animation.
zh_cn: 例如，可以指定动画在整个动画中线性发生，这意味着动画在整个时间内均匀移动，也可以指定动画使用非线性时间，例如，在动画开始时加速，在动画结束时减速。

source: For example:
zh_cn: 例如：

source: For further information related to this lesson, see XML Layouts and Layout Resource.
zh_cn: 有关本课的更多信息，请参见 XML Layouts 和 Layout Resource。

source: For further information related to this topic, see Layout resources.
zh_cn: 有关此主题的更多信息，请参见 Layout resources。

source: For information on permissions and security in general, see the System Permissions.
zh_cn: 有关权限和一般安全性的信息，请参阅 System Permissions。

source: For instance, Canvas provides a method to draw a line, while Paint provides methods to define that line's color.
zh_cn: 例如，Canvas 提供了绘制线条的方法，而 Paint 提供了定义该线条颜色的方法。

source: For instance, PieChart exposes a custom event called OnCurrentItemChanged to notify listeners that the user has rotated the pie chart to focus on a new pie slice.
zh_cn: 例如，PieChart 公开一个名为 OnCurrentItemChanged 的自定义事件，以通知监听器用户已旋转饼图聚焦到新的饼图切片。

source: For instance, if you animated a button to move across the screen, the button draws correctly, but the actual location where you can click the button does not change, so you have to implement your own logic to handle this.
zh_cn: 例如，如果设置按钮的动画以在屏幕上移动，则该按钮会正确绘制，但单击按钮的实际位置不会更改，因此必须实现自己的逻辑来处理此问题。

source: For instance, the PieChart class has an inner class called PieView.
zh_cn: 例如，PieChart 类有一个名为 PieView 的内部类。

source: For instance, this code creates a class that extends GestureDetector.SimpleOnGestureListener and overrides onDown(MotionEvent).
zh_cn: 例如，此代码创建一个继承 GestureDetector.SimpleOnGestureListener 的类，并重写 onDown(MotionEvent)。

source: For manifest-declared receivers, you can set the android:exported attribute to "false" in the manifest.
zh_cn: 对于清单声明的接收器，可以在清单中将 android:exported 属性设置为“false”。

source: For more attributes supported by <alpha>, see the Animation class reference (of which, all XML attributes are inherrited by this element).
zh_cn: 有关 <alpha> 支持的更多属性，请参见 Animation 类引用(其中，所有 XML 属性都由该元素继承)。

source: For more attributes supported by <rotate>, see the Animation class reference (of which, all XML attributes are inherrited by this element).
zh_cn: 有关 <rotate> 支持的更多属性，请参见 Animation 类引用(其中，所有 XML 属性都由该元素继承)。

source: For more attributes supported by <scale>, see the Animation class reference (of which, all XML attributes are inherrited by this element).
zh_cn: 有关 <scale> 支持的更多属性，请参见 Animation 类引用(其中，所有 XML 属性都由该元素继承)。

source: For more attributes supported by <translate>, see the Animation class reference (of which, all XML attributes are inherrited by this element).
zh_cn: 有关 <translate> 支持的更多属性，请参见 Animation 类引用(其中，所有 XML 属性都由该元素继承)。

source: For more examples, see Common Layout Objects.
zh_cn: 更多实例，请参见 Common Layout Objects.

source: For more information about double taxation and how to prevent it, see Performance and View Hierarchies.
zh_cn: 有关双重征税和如何防止双重征税的详细信息，请参见 Performance and View Hierarchies。

source: For more information about how to read intents and get the action string from an intent, see Intents and Intent Filters.
zh_cn: 有关如何读取 intent 并从中获取 action 字符串的详细信息，请参阅 intents and intent Filters。

source: For more information on MotionLayout, see the following links:
zh_cn: 有关 MotionLayout 的详细信息，请参阅下面的链接：

source: For more information on creating accessible views, see Making Applications Accessible in the Android Developers Guide.
zh_cn: 有关创建无障碍 view 的更多信息，请参阅 Android 开发者指南中的 Making Applications Accessible。

source: For more information on designing your app with motion, see the Material Design section on Understanding motion.
zh_cn: 对于与运动设计你的应用程序的更多信息，请参阅 Understanding motion 材质设计部分。

source: For more information on the XML syntax, available tags and attributes, see Animation Resources.
zh_cn: 有关 XML 语法、可用标签和属性的更多信息，请参见 Animation Resources。

source: For more information, read Animate Between Layouts Using a Transition.
zh_cn: 有关详细信息，请阅读 Animate Between Layouts Using a Transition。

source: For more information, read Animate Drawable Graphics.
zh_cn: 有关详细信息，请阅读 Animate Drawable Graphics。

source: For more information, see Auto Animate Layout Updates.
zh_cn: 有关详细信息，请参见 Auto Animate Layout Updates。

source: For more information, see Profile GPU rendering walkthrough.
zh_cn: 有关详细信息，请参见 Profile GPU rendering walkthrough。

source: For more information, see Intelligent Job Scheduling.
zh_cn: 有关详细信息，请参见 Intelligent Job Scheduling。

source: For more information, see Effect on process state To perform long running work, we recommend:
zh_cn: 有关详细信息，请参见 Effect on process state 要执行长时间运行的工作，我们建议：

source: For more information, see Processes and Application Life Cycle.
zh_cn: 有关详细信息，请参见 Processes and Application Life Cycle。
